/**
	************************************************************
	************************************************************
	************************************************************
	*文件名：dht11.h
	*
	*作者：ZRGBM
	*
	*最后修改日期：2025年12月6日
	*
	*版本：6.0.0
	*
	*说明：温湿度传感器的头文件
	************************************************************
	************************************************************
	************************************************************
**/

#ifndef __DHT11_H
#define __DHT11_H
#include "sys.h"

// ZRGBM
#define DHT11_IO_IN()  {GPIOA->CRL&=0XFFFFFFF0;GPIOA->CRL|=8<<0;}
#define DHT11_IO_OUT() {GPIOA->CRL&=0XFFFFFFF0;GPIOA->CRL|=3<<0;}
#define DHT11_DQ_OUT PAout(0) // 数据端口 PA0
#define DHT11_DQ_IN  PAin(0)  // 数据端口 PA0

u8 DHT11_Init(void); // 初始化
u8 DHT11_Read_Data(u8 *temp,u8 *humi); // 读取温湿度
u8 DHT11_Check(void); // 检测是否存在
void DHT11_Rst(void); // 复位

#endif
