/**
	************************************************************
	************************************************************
	************************************************************
	*文件名：ent.h
	*
	*作者：ZRGBM
	*
	*最后修改日期：2025年12月6日
	*
	*版本：6.0.0
	*
	*说明：接收数据与发送数据的云平台回复
	************************************************************
	************************************************************
	************************************************************
**/
#ifndef __ENT_H
#define __ENT_H
#include "sys.h"

// ZRGBM
void MQTT_Publish_Data(u8 temp, u8 humi, u8 door, u8 led, char* prod_id, char* dev_name);
void MQTT_Send_Reply(char *msg_id, char* prod_id, char* dev_name);

#endif
